src/cf/InformationRegisters/вогОбъектыДляПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогОбъектыДляПроцесса</Name>
			<Comment>// Тищенко В.В. Содержит дополнительные объекты для БП</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогАнкета</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогМенеджерыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогМенеджерыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьБрендМенеджерВТТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогВладелецМенеджеров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогНоменклатурныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДляОтчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогПроизводитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьвогУниверсальнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьвогЕдиницаИзмеренияМест</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬвогКоллекцияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогКоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСпособПополнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Панно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСоставныхЭлементов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСоставногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаСоставногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСтатусыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРейтингиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогУсловияХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовараДляWMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыТовараДляWMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыУпаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогЦветПроизводителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЦветаПроизводителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоТиража</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеновойСегментФабрики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЦеновойСегментФабрики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЦеноваяГруппа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификаторМатрицы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМатриц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогСоставМозаики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧипов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Компаньоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компаньон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Коллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Удалить_Коллекция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоллекцияПроизводителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КоллекцииНоменклатурыПроизводителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/вогОбъектыДляПроцессаСервер/Ext/Module.bsl
Процедура НастроитьЭлементыФормы(Форма, ОтображатьНеДоступныеДляРедактирования = Ложь) Экспорт
	
	
	ПараметрыНастройкиБизнесПроцессов = Форма.ПараметрыНастройкиБизнесПроцессов;
	
	ВариантЗаполненияДанных = Форма.ВариантЗаполненияДанных;
			
	КлиентыВидимость = ПараметрыНастройкиБизнесПроцессов.Клиенты;
		
	НоменклатураВидимость = ПараметрыНастройкиБизнесПроцессов.Номенклатура;
		
	КоллекцииВидимость = ПараметрыНастройкиБизнесПроцессов.Коллекции;	
		
	ТорговыеТочкиВидимость = ПараметрыНастройкиБизнесПроцессов.ТорговыеТочки;
	
	НаселенныйПунктВидимость = ПараметрыНастройкиБизнесПроцессов.ЗаполнятьНаселенныйПункт; //VOG Ульянов И.В. 03.02.2020 CRM-264
	
	КлиентыРедактирование = ПараметрыНастройкиБизнесПроцессов.ВариантЗаполненияДанныхКлиенты = ВариантЗаполненияДанных;
			
	НоменклатураРедактирование = ПараметрыНастройкиБизнесПроцессов.ВариантЗаполненияДанныхНоменклатураКоллекции = ВариантЗаполненияДанных;
		
	КоллекцииРедактирование = ПараметрыНастройкиБизнесПроцессов.ВариантЗаполненияДанныхНоменклатураКоллекции = ВариантЗаполненияДанных;	
		
	ТорговыеТочкиРедактирование = ПараметрыНастройкиБизнесПроцессов.ВариантЗаполненияДанныхТорговыеТочки = ВариантЗаполненияДанных;

	Если ОтображатьНеДоступныеДляРедактирования = Ложь Тогда
		КлиентыВидимость = КлиентыВидимость и КлиентыРедактирование;
		ТорговыеТочкиВидимость = ТорговыеТочкиВидимость и ТорговыеТочкиРедактирование;
		НоменклатураВидимость = НоменклатураВидимость и НоменклатураРедактирование;
		КоллекцииВидимость = КоллекцииВидимость и КоллекцииРедактирование;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "НаселенныйПункт"  , "Видимость", НаселенныйПунктВидимость));  //VOG Ульянов И.В. 03.02.2020 CRM-264
	
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ГруппаТорговыеТочки"  , "Видимость", ТорговыеТочкиВидимость));
		
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ГруппаКлиенты"		   , "Видимость", КлиентыВидимость));  
	
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ГруппаНоменклатура"   , "Видимость", НоменклатураВидимость));
	
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ГруппаКоллекции"      , "Видимость", КоллекцииВидимость));
	
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ТаблицаТорговыеТочки"  , "ТолькоПросмотр", Не ТорговыеТочкиРедактирование));
		
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ТаблицаКлиенты"		, "ТолькоПросмотр", Не КлиентыРедактирование));  
	
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ТаблицаНоменклатура"   , "ТолькоПросмотр", Не НоменклатураРедактирование));
	
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ТаблицаКоллекции"      , "ТолькоПросмотр", Не КоллекцииРедактирование));
			
	МассивЭлементов.Добавить(Новый Структура("ИмяЭлемента, Свойство, Значение", "ПовесткаПредставление", "Видимость", ПараметрыНастройкиБизнесПроцессов.Повестка));
		 	 	
	Для каждого ОписаниеЭлемента Из МассивЭлементов Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, 
			ОписаниеЭлемента.ИмяЭлемента, ОписаниеЭлемента.Свойство, ОписаниеЭлемента.Значение); 
			
	КонецЦикла;
		
КонецПроцедуры // НастроитьЭлементыФормы()	

Процедура ПрочитатьСвязанныеДанные(Форма, Процесс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогОбъектыДляПроцесса.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.вогОбъектыДляПроцесса КАК вогОбъектыДляПроцесса
		|ГДЕ
		|	вогОбъектыДляПроцесса.Объект ССЫЛКА Справочник.Партнеры
		|	И вогОбъектыДляПроцесса.Процесс = &Процесс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогОбъектыДляПроцесса.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.вогОбъектыДляПроцесса КАК вогОбъектыДляПроцесса
		|ГДЕ
		|	вогОбъектыДляПроцесса.Объект ССЫЛКА Справочник.вогТорговыеТочки
		|	И вогОбъектыДляПроцесса.Процесс = &Процесс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогОбъектыДляПроцесса.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.вогОбъектыДляПроцесса КАК вогОбъектыДляПроцесса
		|ГДЕ
		|	вогОбъектыДляПроцесса.Объект ССЫЛКА Справочник.Номенклатура
		|	И вогОбъектыДляПроцесса.Процесс = &Процесс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогОбъектыДляПроцесса.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.вогОбъектыДляПроцесса КАК вогОбъектыДляПроцесса
		|ГДЕ
		|	вогОбъектыДляПроцесса.Объект ССЫЛКА Справочник.вогКоллекцииНоменклатуры
		|	И вогОбъектыДляПроцесса.Процесс = &Процесс";
	
	Запрос.УстановитьПараметр("Процесс", Процесс);
 	                       
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Форма.ТаблицаКлиентов.Загрузить(РезультатЗапроса[0].Выгрузить());
	Форма.ТаблицаТорговыхТочек.Загрузить(РезультатЗапроса[1].Выгрузить());
	Форма.ТаблицаНоменклатура.Загрузить(РезультатЗапроса[2].Выгрузить());
	Форма.ТаблицаКоллекции.Загрузить(РезультатЗапроса[3].Выгрузить());	
 	
КонецПроцедуры // ПрочитатьСвязанныеДанные()

Процедура ЗаписатьСвязанныеДанные(Процесс, Форма) Экспорт
	            		
	Набор = РегистрыСведений.вогОбъектыДляПроцесса.СоздатьНаборЗаписей();
	Набор.Отбор.Процесс.Установить(Процесс);	
	Набор.Очистить();
	
	ТаблицаОбъектов = Набор.Выгрузить();
			
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Форма.ТаблицаКлиентов, ТаблицаОбъектов);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Форма.ТаблицаТорговыхТочек, ТаблицаОбъектов);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Форма.ТаблицаНоменклатура, ТаблицаОбъектов);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Форма.ТаблицаКоллекции, ТаблицаОбъектов);
	
	ТаблицаОбъектов.ЗаполнитьЗначения(Процесс, "Процесс");

	Набор.Загрузить(ТаблицаОбъектов);
	
	Набор.Записать();
		
КонецПроцедуры // ЗаписатьСвязанныеДанные()

Процедура ЗаписатьСвязанныеДанныеПоЗадаче(Процесс,ТаблицаОбъектов) Экспорт
	            		
	Набор = РегистрыСведений.вогОбъектыДляПроцесса.СоздатьНаборЗаписей();
	Набор.Отбор.Процесс.Установить(Процесс);	
	Набор.Очистить();
	
	ТаблицаОбъектов.ЗаполнитьЗначения(Процесс, "Процесс");

	Набор.Загрузить(ТаблицаОбъектов);
	
	Набор.Записать();
		
КонецПроцедуры // ЗаписатьСвязанныеДанные()


Функция ПолучитьТаблицуОбъектовПоПроцессу(Процесс) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогОбъектыДляПроцесса.Процесс КАК Процесс,
		|	вогОбъектыДляПроцесса.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.вогОбъектыДляПроцесса КАК вогОбъектыДляПроцесса
		|ГДЕ
		|	вогОбъектыДляПроцесса.Процесс = &Процесс";
	
	Запрос.УстановитьПараметр("Процесс", Процесс);
	
	Возврат Запрос.Выполнить().Выгрузить();  
	
КонецФункции	

Функция ПолучитьКлиентовМенеджера(Роль, Менеджер, Клиенты) Экспорт
		 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогТорговыеТочки.Ссылка КАК Объект,
		|	вогТорговыеТочки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ТорговыеТочки
		|ИЗ
		|	Справочник.вогТорговыеТочки КАК вогТорговыеТочки
		|ГДЕ
		|	вогТорговыеТочки.Ссылка В(&Клиенты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вогТорговыеТочки.Партнер,
		|	вогТорговыеТочки.Ссылка
		|ИЗ
		|	Справочник.вогТорговыеТочки КАК вогТорговыеТочки
		|ГДЕ
		|	вогТорговыеТочки.Партнер В(&Клиенты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ТорговыеТочки.Объект КАК Объект,
		|	"""" КАК Процесс
		|ИЗ
		|	РегистрСведений.вогМенеджерыОбъектов КАК вогМенеджерыОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТорговыеТочки КАК ВТ_ТорговыеТочки
		|		ПО вогМенеджерыОбъектов.Владелец = ВТ_ТорговыеТочки.Ссылка
		|ГДЕ
		|	вогМенеджерыОбъектов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|	И вогМенеджерыОбъектов.Менеджер = &Менеджер
		|	И вогМенеджерыОбъектов.Роль = &Роль";
	
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("Клиенты", Клиенты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	       
	
КонецФункции
